wolfSSL/wolfssl/wolfcrypt/src/port/maxim/max3266x.c
int wc_MXC_TPU_SHA_Update(unsigned int* digest, unsigned int* buffer,
                           unsigned int* buffLen, unsigned int* loLen,
                           unsigned int* hiLen, int stateWords,
                           unsigned int blockSz, MXC_TPU_HASH_TYPE algo,
                           const unsigned char* data, unsigned int len);
int wc_MXC_TPU_SHA_Final(unsigned int* digest, unsigned int* buffer,
                           unsigned int* buffLen, unsigned int loLen,
                           unsigned int hiLen, int stateWords,
                           unsigned int digestSz, MXC_TPU_HASH_TYPE algo,
                           unsigned char* hash);
static int wc_MXC_TPU_SHA_Init(unsigned int* digest, int stateWords,
                                MXC_TPU_HASH_TYPE algo);

static int wc_MxcShaCbDispatch(
                    unsigned int* digest, unsigned int* buffer,
                    unsigned int* buffLen, unsigned int* loLen,
                    unsigned int* hiLen, void** devCtx, int stateWords,
                    unsigned int blockSz, unsigned int digestSz,
                    MXC_TPU_HASH_TYPE algo,
                    const unsigned char* in, unsigned int inSz,
                    unsigned char* outDigest)
{
    if (*devCtx == NULL) {
        int initRet = wc_MXC_TPU_SHA_Init(digest, stateWords, algo);
        if (initRet != 0)
            return initRet;
        *devCtx = (void*)1;
    }

    if (in != NULL && outDigest == NULL) {
        MAX3266X_MSG("Update CB");
        return wc_MXC_TPU_SHA_Update(digest, buffer, buffLen, loLen, hiLen,
                                      stateWords, blockSz, algo, in, inSz);
    }
    if (in == NULL && outDigest != NULL) {
        int ret;
        MAX3266X_MSG("Final CB");
        ret = wc_MXC_TPU_SHA_Final(digest, buffer, buffLen,
                                        *loLen, *hiLen, stateWords,
                                        digestSz, algo, outDigest);
        /* Reset context state for reuse */
        if (ret == 0) {
            *buffLen = 0;
            *loLen = 0;
            *hiLen = 0;
            XMEMSET(buffer, 0, blockSz);
            ret = wc_MXC_TPU_SHA_Init(digest, stateWords, algo);
        }
        return ret;
    }
    if (inSz == 0) {
        return 0; /* Don't need to Update when size is zero */
    }
    return BAD_FUNC_ARG;
}

/* SHA-384/512 callback helper: bridges word64 loLen to unsigned int pair
 * and delegates to wc_MxcShaCbDispatch. */
static int wc_MxcShaCbDispatch512(wc_Sha512* ctx, int stateWords,
                    unsigned int blockSz, unsigned int digestSz,
                    MXC_TPU_HASH_TYPE algo,
                    const unsigned char* in, unsigned int inSz,
                    unsigned char* digest)
{
    unsigned int loLen = (unsigned int)ctx->loLen;
    unsigned int hiLen = (unsigned int)(ctx->loLen >> 32);
    int ret;

    ret = wc_MxcShaCbDispatch((unsigned int*)ctx->digest,
                               (unsigned int*)ctx->buffer,
                               &ctx->buffLen, &loLen, &hiLen,
                               &ctx->devCtx, stateWords, blockSz, digestSz,
                               algo, in, inSz, digest);

    ctx->loLen = (word64)loLen | ((word64)hiLen << 32);
    return ret;
}

int wc_MxcShaCryptoCb(wc_CryptoInfo* info)
{
    switch (info->hash.type) {
    #ifndef NO_SHA
        case WC_HASH_TYPE_SHA:
            return wc_MxcShaCbDispatch(
                        info->hash.sha1->digest,
                        info->hash.sha1->buffer,
                        &info->hash.sha1->buffLen,
                        &info->hash.sha1->loLen, &info->hash.sha1->hiLen,
                        &info->hash.sha1->devCtx,
                        MXC_SHA1_STATE_WORDS, WC_SHA_BLOCK_SIZE,
                        WC_SHA_DIGEST_SIZE, MXC_TPU_HASH_SHA1,
                        info->hash.in, info->hash.inSz, info->hash.digest);
    #endif
    #ifdef WOLFSSL_SHA224
        case WC_HASH_TYPE_SHA224:
            return wc_MxcShaCbDispatch(
                        info->hash.sha224->digest,
                        info->hash.sha224->buffer,
                        &info->hash.sha224->buffLen,
                        &info->hash.sha224->loLen, &info->hash.sha224->hiLen,
                        &info->hash.sha224->devCtx,
                        MXC_SHA224_STATE_WORDS, WC_SHA224_BLOCK_SIZE,
                        WC_SHA224_DIGEST_SIZE, MXC_TPU_HASH_SHA224,
                        info->hash.in, info->hash.inSz, info->hash.digest);
    #endif
    #ifndef NO_SHA256
        case WC_HASH_TYPE_SHA256:
            return wc_MxcShaCbDispatch(
                        info->hash.sha256->digest,
                        info->hash.sha256->buffer,
                        &info->hash.sha256->buffLen,
                        &info->hash.sha256->loLen, &info->hash.sha256->hiLen,
                        &info->hash.sha256->devCtx,
                        MXC_SHA256_STATE_WORDS, WC_SHA256_BLOCK_SIZE,
                        WC_SHA256_DIGEST_SIZE, MXC_TPU_HASH_SHA256,
                        info->hash.in, info->hash.inSz, info->hash.digest);
    #endif
    #ifdef WOLFSSL_SHA384
        case WC_HASH_TYPE_SHA384:
            return wc_MxcShaCbDispatch512(info->hash.sha384,
                        MXC_SHA384_STATE_WORDS, WC_SHA384_BLOCK_SIZE,
                        WC_SHA384_DIGEST_SIZE, MXC_TPU_HASH_SHA384,
                        info->hash.in, info->hash.inSz, info->hash.digest);
    #endif
    #ifdef WOLFSSL_SHA512
        case WC_HASH_TYPE_SHA512:
            return wc_MxcShaCbDispatch512(info->hash.sha512,
                        MXC_SHA512_STATE_WORDS, WC_SHA512_BLOCK_SIZE,
                        WC_SHA512_DIGEST_SIZE, MXC_TPU_HASH_SHA512,
                        info->hash.in, info->hash.inSz, info->hash.digest);
    #endif
        default:
            return WC_NO_ERR_TRACE(CRYPTOCB_UNAVAILABLE);
    }
}

#endif /* WOLFSSL_MAX3266X_SHA_ONESHOT */
#endif /* MAX3266X_SHA_CB */

#ifdef WOLF_CRYPTO_CB_COPY
#ifdef WOLFSSL_MAX3266X_SHA_ONESHOT
static int wc_MxcCopyCb(wc_CryptoInfo* info)
{
    if (info == NULL || info->copy.src == NULL || info->copy.dst == NULL) {
        return BAD_FUNC_ARG;
    }

    switch (info->copy.type) {
#ifdef MAX3266X_SHA_CB
    #ifndef NO_SHA
        case WC_HASH_TYPE_SHA:
            return wc_MXC_TPU_SHA_Copy(info->copy.src, info->copy.dst,
                        sizeof(wc_Sha),
                        &((wc_Sha*)info->copy.dst)->msg,
                        &((wc_Sha*)info->copy.dst)->used,
                        &((wc_Sha*)info->copy.dst)->len,
                        ((wc_Sha*)info->copy.dst)->heap,
                        ((wc_Sha*)info->copy.src)->heap);
    #endif
    #ifdef WOLFSSL_SHA224
        case WC_HASH_TYPE_SHA224:
            return wc_MXC_TPU_SHA_Copy(info->copy.src, info->copy.dst,
                        sizeof(wc_Sha224),
                        &((wc_Sha224*)info->copy.dst)->msg,
                        &((wc_Sha224*)info->copy.dst)->used,
                        &((wc_Sha224*)info->copy.dst)->len,
                        ((wc_Sha224*)info->copy.dst)->heap,
                        ((wc_Sha224*)info->copy.src)->heap);
    #endif
    #ifndef NO_SHA256
        case WC_HASH_TYPE_SHA256:
            return wc_MXC_TPU_SHA_Copy(info->copy.src, info->copy.dst,
                        sizeof(wc_Sha256),
                        &((wc_Sha256*)info->copy.dst)->msg,
                        &((wc_Sha256*)info->copy.dst)->used,
                        &((wc_Sha256*)info->copy.dst)->len,
                        ((wc_Sha256*)info->copy.dst)->heap,
                        ((wc_Sha256*)info->copy.src)->heap);
    #endif
    #ifdef WOLFSSL_SHA384
        case WC_HASH_TYPE_SHA384:
            return wc_MXC_TPU_SHA_Copy(info->copy.src, info->copy.dst,
                        sizeof(wc_Sha384),
                        &((wc_Sha384*)info->copy.dst)->msg,
                        &((wc_Sha384*)info->copy.dst)->used,
                        &((wc_Sha384*)info->copy.dst)->len,
                        ((wc_Sha384*)info->copy.dst)->heap,
                        ((wc_Sha384*)info->copy.src)->heap);
    #endif
    #ifdef WOLFSSL_SHA512
        case WC_HASH_TYPE_SHA512:
            return wc_MXC_TPU_SHA_Copy(info->copy.src, info->copy.dst,
                        sizeof(wc_Sha512),
                        &((wc_Sha512*)info->copy.dst)->msg,
                        &((wc_Sha512*)info->copy.dst)->used,
                        &((wc_Sha512*)info->copy.dst)->len,
                        ((wc_Sha512*)info->copy.dst)->heap,
                        ((wc_Sha512*)info->copy.src)->heap);
    #endif
#endif /* MAX3266X_SHA_CB */
        default:
            return WC_NO_ERR_TRACE(CRYPTOCB_UNAVAILABLE);
    }
}
#else /* WOLFSSL_MAX3266X_SHA_ONESHOT */
static int wc_MxcCopyCb(wc_CryptoInfo* info)
{
    word32 sz;

    if (info == NULL || info->copy.src == NULL || info->copy.dst == NULL) {
        return BAD_FUNC_ARG;
    }

    switch (info->copy.type) {
#ifdef MAX3266X_SHA_CB
    #ifndef NO_SHA
        case WC_HASH_TYPE_SHA:
            wc_ShaFree((wc_Sha*)info->copy.dst);
            sz = sizeof(wc_Sha);
            break;
    #endif
    #ifdef WOLFSSL_SHA224
        case WC_HASH_TYPE_SHA224:
            wc_Sha224Free((wc_Sha224*)info->copy.dst);
            sz = sizeof(wc_Sha224);
            break;
    #endif
    #ifndef NO_SHA256
        case WC_HASH_TYPE_SHA256:
            wc_Sha256Free((wc_Sha256*)info->copy.dst);
            sz = sizeof(wc_Sha256);
            break;
    #endif
    #ifdef WOLFSSL_SHA384
        case WC_HASH_TYPE_SHA384:
            wc_Sha384Free((wc_Sha384*)info->copy.dst);
            sz = sizeof(wc_Sha384);
            break;
    #endif
    #ifdef WOLFSSL_SHA512
        case WC_HASH_TYPE_SHA512:
            wc_Sha512Free((wc_Sha512*)info->copy.dst);
            sz = sizeof(wc_Sha512);
            break;
    #endif
#endif /* MAX3266X_SHA_CB */
        default:
            return WC_NO_ERR_TRACE(CRYPTOCB_UNAVAILABLE);
    }
    XMEMCPY(info->copy.dst, info->copy.src, sz);
    return 0;
}
#endif /* WOLFSSL_MAX3266X_SHA_ONESHOT */
#endif /* WOLF_CRYPTO_CB_COPY */

