wolfSSL/wolfssl/wolfcrypt/src/port/maxim/max3266x.c
#ifdef WOLF_CRYPTO_CB_FREE
static int wc_MxcFreeCb(wc_CryptoInfo* info)
{
    if (info == NULL || info->free.obj == NULL) {
        return BAD_FUNC_ARG;
    }

    switch (info->free.type) {
#ifdef MAX3266X_SHA_CB
    #ifndef NO_SHA
        case WC_HASH_TYPE_SHA:
            wc_MXC_TPU_SHA_FreeCtx(info->free.obj, sizeof(wc_Sha),
                        &((wc_Sha*)info->free.obj)->msg,
                        &((wc_Sha*)info->free.obj)->used,
                        &((wc_Sha*)info->free.obj)->len,
                        ((wc_Sha*)info->free.obj)->heap);
            return 0;
    #endif
    #ifdef WOLFSSL_SHA224
        case WC_HASH_TYPE_SHA224:
            wc_MXC_TPU_SHA_FreeCtx(info->free.obj, sizeof(wc_Sha224),
                        &((wc_Sha224*)info->free.obj)->msg,
                        &((wc_Sha224*)info->free.obj)->used,
                        &((wc_Sha224*)info->free.obj)->len,
                        ((wc_Sha224*)info->free.obj)->heap);
            return 0;
    #endif
    #ifndef NO_SHA256
        case WC_HASH_TYPE_SHA256:
            wc_MXC_TPU_SHA_FreeCtx(info->free.obj, sizeof(wc_Sha256),
                        &((wc_Sha256*)info->free.obj)->msg,
                        &((wc_Sha256*)info->free.obj)->used,
                        &((wc_Sha256*)info->free.obj)->len,
                        ((wc_Sha256*)info->free.obj)->heap);
            return 0;
    #endif
    #ifdef WOLFSSL_SHA384
        case WC_HASH_TYPE_SHA384:
            wc_MXC_TPU_SHA_FreeCtx(info->free.obj, sizeof(wc_Sha384),
                        &((wc_Sha384*)info->free.obj)->msg,
                        &((wc_Sha384*)info->free.obj)->used,
                        &((wc_Sha384*)info->free.obj)->len,
                        ((wc_Sha384*)info->free.obj)->heap);
            return 0;
    #endif
    #ifdef WOLFSSL_SHA512
        case WC_HASH_TYPE_SHA512:
            wc_MXC_TPU_SHA_FreeCtx(info->free.obj, sizeof(wc_Sha512),
                        &((wc_Sha512*)info->free.obj)->msg,
                        &((wc_Sha512*)info->free.obj)->used,
                        &((wc_Sha512*)info->free.obj)->len,
                        ((wc_Sha512*)info->free.obj)->heap);
            return 0;
    #endif
#endif /* MAX3266X_SHA_CB */
        default:
            return WC_NO_ERR_TRACE(CRYPTOCB_UNAVAILABLE);
    }
}
#endif /* WOLF_CRYPTO_CB_FREE */

/* General Callback Function to determine ALGO Type */
int wc_MxcCryptoCb(int devIdArg, wc_CryptoInfo* info, void* ctx)
{
    int ret;
    (void)ctx;
    (void)devIdArg;

    if (info == NULL) {
        return BAD_FUNC_ARG;
    }

#ifdef DEBUG_CRYPTOCB
    wc_CryptoCb_InfoString(info);
#endif

    switch (info->algo_type) {
        case WC_ALGO_TYPE_CIPHER:
            MAX3266X_MSG("Using MXC AES HW Callback:");
            ret = wc_MxcAesCryptoCb(info); /* Determine AES HW or SW */
            break;
#ifdef MAX3266X_SHA_CB
        case WC_ALGO_TYPE_HASH:
            MAX3266X_MSG("Using MXC SHA HW Callback:");
            ret = wc_MxcShaCryptoCb(info); /* Determine SHA HW or SW */
            break;
#endif /* MAX3266X_SHA_CB */
#ifdef WOLF_CRYPTO_CB_COPY
        case WC_ALGO_TYPE_COPY:
            MAX3266X_MSG("Using MXC Copy Callback:");
            ret = wc_MxcCopyCb(info);
            break;
#endif /* WOLF_CRYPTO_CB_COPY */
#ifdef WOLF_CRYPTO_CB_FREE
        case WC_ALGO_TYPE_FREE:
            MAX3266X_MSG("Using MXC Free Callback:");
            ret = wc_MxcFreeCb(info);
            break;
#endif /* WOLF_CRYPTO_CB_FREE */
        default:
            MAX3266X_MSG("Callback not supported with MXC, using SW");
            /* return this to bypass HW and use SW */
            ret = WC_NO_ERR_TRACE(CRYPTOCB_UNAVAILABLE);
    }

    return ret;
}
#endif

/* Convert Error Codes Correctly and Report HW error when */
/* using #define MAX3266X_VERBOSE */
int wc_MXC_error(int *ret)
{
    if (ret == NULL) {
        /* In case somehow pointer to the return code is NULL */
        return BAD_FUNC_ARG;
    }
    switch (*ret) {
        case E_SUCCESS:
            return 0;

        case E_INVALID: /* Process Failed */
            MAX3266X_MSG("HW Reported: E_INVALID Error");
            *ret = WC_HW_E;
            break;

        case E_NULL_PTR:
            MAX3266X_MSG("HW Reported: E_NULL_PTR Error");
            *ret = BAD_FUNC_ARG;
            break;

        case E_BAD_PARAM:
            MAX3266X_MSG("HW Reported: E_BAD_PARAM Error");
            *ret = BAD_FUNC_ARG;
            break;

        case E_BAD_STATE:
            MAX3266X_MSG("HW Reported: E_BAD_STATE Error");
            *ret = WC_HW_E;
            break;

        default:
            MAX3266X_MSG("HW Reported an Unknown Error");
            *ret = WC_HW_E; /* If something else return HW Error */
            break;
    }
    return *ret;
}


#if defined(MAX3266X_RNG)
/* Simple call to SDK's TRNG HW */
int wc_MXC_TRNG_Random(unsigned char* output, unsigned int sz)
{
    int status;
    if (output == NULL) {
        return BAD_FUNC_ARG;
    }
    status = wolfSSL_HwRngMutexLock(); /* Lock Mutex needed since */
                                         /* calling TPU init */
    if (status != 0) {
        return status;
    }
#if defined(WOLFSSL_MAX3266X_OLD)
    status = TRNG_Init(NULL);
#else
    status = MXC_TPU_Init(MXC_SYS_PERIPH_CLOCK_TRNG);
#endif
    if (status == 0) {
        /* void return function */
        MXC_TPU_TRNG_Read(MXC_TRNG, output, sz);
        MAX3266X_MSG("TRNG Hardware Used");
    }
    else {
        MAX3266X_MSG("TRNG Device did not initialize");
        status = RNG_FAILURE_E;
    }
    wolfSSL_HwRngMutexUnLock(); /* Unlock Mutex no matter status value */
    return status;
}

#if defined(WOLFSSL_MAX3266X_OLD)
/* Implements TRNG on-demand health test (the older SDK does not provide one) */
int wc_MXC_TRNG_HealthTest(void)
{
    if (TRNG_Init(NULL) != 0) {
        MAX3266X_MSG("TRNG Device did not initialize");
        return RNG_FAILURE_E;
    }

    while ((MXC_TRNG->st & MXC_F_TRNG_ST_RND_RDY) == 0) {}

    /* Clear on-going test if necessary */
    if (MXC_TRNG->cn & MXC_F_TRNG_CN_ODHT) {
        MXC_TRNG->cn &= ~MXC_F_TRNG_CN_ODHT;
        while (MXC_TRNG->st & MXC_F_TRNG_ST_ODHTS) {}
    }

    /* Start on-demand health test */
    MXC_TRNG->cn |= MXC_F_TRNG_CN_ODHT;

    /* Wait for the test to finish */
    while (MXC_TRNG->st & MXC_F_TRNG_ST_ODHTS) {}

    /* Check results of test */
    if (MXC_TRNG->st & MXC_F_TRNG_ST_HTS) {
        MAX3266X_MSG("TRNG HW Health Test Failed");
        return WC_HW_E;
    }
    return 0;
}
#endif /* WOLFSSL_MAX3266X_OLD */
#endif /* MAX3266X_RNG */

