wolfSSL/wolfssl/wolfcrypt/src/port/maxim/max3266x.c
    /* Free existing dst msg buffer using dst's original heap */
    wc_MXC_TPU_SHA_Free(dstMsg, dstUsed, dstLen, dstHeap);

    /* Shallow copy the full context struct */
    XMEMCPY(dst, src, ctxSz);

    /* Deep copy src msg buffer if present. Since dstMsg points into the dst
     * struct, the XMEMCPY above overwrites it with the src's msg pointer.
     * Save that pointer, allocate a new buffer for dst, and copy the data.
     * Do NOT move srcBuf assignment before XMEMCPY - it must capture the
     * src msg pointer that lands in *dstMsg after the shallow copy. */
    if (*dstMsg != NULL) {
        srcBuf = *dstMsg;
        *dstMsg = (byte*)XMALLOC(*dstLen, srcHeap, DYNAMIC_TYPE_TMP_BUFFER);
        if (*dstMsg == NULL) {
            return MEMORY_E;
        }
        XMEMCPY(*dstMsg, srcBuf, *dstUsed);
    }

    return 0;
}

/* Compute hash, free message buffer, and reset HASH_KEEP fields */
int wc_MXC_TPU_SHA_Final(unsigned char** msg, unsigned int* used,
                                    unsigned int* len, void* heap,
                                    unsigned char* digest,
                                    MXC_TPU_HASH_TYPE algo)
{
    int status;
    if (msg == NULL || used == NULL || len == NULL || digest == NULL) {
        return BAD_FUNC_ARG;
    }
    status = wc_MXC_TPU_SHA_GetHash(*msg, *used, digest, algo);
    wc_MXC_TPU_SHA_Free(msg, used, len, heap);
    return status;
}

#else /* WOLFSSL_MAX3266X_SHA_ONESHOT */

/* TPU hash helpers (bare-metal SHA accelerator) */

#if defined(WOLFSSL_MAX3266X_OLD)
    #define MXC_TPU_DATA_IN din
#else
    #define MXC_TPU_DATA_IN data_in
#endif

/* Reset TPU, select hash function, and restore intermediate state into
 * the HASH_DIGEST registers. */
void wc_MXC_TPU_Hash_Setup(MXC_TPU_HASH_TYPE algo,
                            const unsigned int* state, int stateWords)
{
    int i;

    /* Init TPU clock */
    MXC_TPU_Init(MXC_SYS_PERIPH_CLOCK_TPU);

    /* Reset TPU */
    MXC_TPU->ctrl = MXC_F_TPU_CTRL_RST;
    while (!(MXC_TPU->ctrl & MXC_F_TPU_CTRL_RDY)) {}
    MXC_TPU->ctrl |= MXC_F_TPU_CTRL_FLAG_MODE;

    /* Select hash function and INIT to prime the hardware's internal state */
    MXC_TPU->hash_ctrl = ((unsigned int)algo << MXC_F_TPU_HASH_CTRL_HASH_POS)
                        | MXC_F_TPU_HASH_CTRL_INIT;
    while (MXC_TPU->hash_ctrl & MXC_F_TPU_HASH_CTRL_INIT) {}

    /* Overwrite the standard IV with our saved intermediate state */
    for (i = 0; i < stateWords; i++) {
        MXC_TPU->hash_digest[i] = state[i];
    }
}

/* Feed one complete block to the TPU and wait for completion. */
void wc_MXC_TPU_Hash_Feed_Block(const unsigned char* data,
                                 unsigned int blockSz)
{
    unsigned int word;

    MXC_TPU->ctrl |= MXC_F_TPU_CTRL_DMA_DONE | MXC_F_TPU_CTRL_GLS_DONE |
                     MXC_F_TPU_CTRL_HSH_DONE | MXC_F_TPU_CTRL_CPH_DONE |
                     MXC_F_TPU_CTRL_MAA_DONE;

    for (word = 0; word < blockSz; word += 4) {
        while (!(MXC_TPU->ctrl & MXC_F_TPU_CTRL_RDY)) {}
        MXC_TPU->MXC_TPU_DATA_IN[0] = (unsigned int)data[word]
                             | ((unsigned int)data[word + 1] << 8)
                             | ((unsigned int)data[word + 2] << 16)
                             | ((unsigned int)data[word + 3] << 24);
    }

    while (!(MXC_TPU->ctrl & MXC_F_TPU_CTRL_HSH_DONE)) {}
}

/* Feed the last (possibly partial) block with LAST flag and msg size. */
void wc_MXC_TPU_Hash_Feed_Last(const unsigned char* data,
                                unsigned int dataLen,
                                unsigned int totalLenLo,
                                unsigned int totalLenHi)
{
    unsigned int word;

    /* Set total message size for padding calculation */
    MXC_TPU->hash_msg_sz[0] = totalLenLo;
    MXC_TPU->hash_msg_sz[1] = totalLenHi;

    /* Signal this is the last block */
    MXC_TPU->hash_ctrl |= MXC_F_TPU_HASH_CTRL_LAST;

    /* Empty message: the hardware needs a dummy write to data_in to
     * trigger processing of the padding-only block. */
    if (totalLenLo == 0 && totalLenHi == 0) {
        while (!(MXC_TPU->ctrl & MXC_F_TPU_CTRL_RDY)) {}
        MXC_TPU->MXC_TPU_DATA_IN[0] = 0;
    }

    for (word = 0; word < dataLen; word += 4) {
        while (!(MXC_TPU->ctrl & MXC_F_TPU_CTRL_RDY)) {}
        if (dataLen >= (word + 4)) {
            MXC_TPU->MXC_TPU_DATA_IN[0] = (unsigned int)data[word]
                                 | ((unsigned int)data[word + 1] << 8)
                                 | ((unsigned int)data[word + 2] << 16)
                                 | ((unsigned int)data[word + 3] << 24);
        }
        else if ((dataLen & 3) == 1) {
            MXC_TPU->MXC_TPU_DATA_IN[0] = (unsigned int)data[word];
        }
        else if ((dataLen & 3) == 2) {
            MXC_TPU->MXC_TPU_DATA_IN[0] = (unsigned int)data[word]
                                 | ((unsigned int)data[word + 1] << 8);
        }
        else if ((dataLen & 3) == 3) {
            MXC_TPU->MXC_TPU_DATA_IN[0] = (unsigned int)data[word]
                                 | ((unsigned int)data[word + 1] << 8)
                                 | ((unsigned int)data[word + 2] << 16);
        }
    }

    while (!(MXC_TPU->ctrl & MXC_F_TPU_CTRL_HSH_DONE)) {}
}

/* Save intermediate hash state from hardware registers into context. */
void wc_MXC_TPU_Hash_Save_State(unsigned int* state, int stateWords)
{
    int i;
    for (i = 0; i < stateWords; i++) {
        state[i] = MXC_TPU->hash_digest[i];
    }
}

/* Read final digest from hardware registers. */
void wc_MXC_TPU_Hash_Read_Digest(unsigned char* digest, unsigned int digestSz)
{
    XMEMCPY(digest, (const void*)MXC_TPU->hash_digest, digestSz);
}

/* Generic Update */
int wc_MXC_TPU_SHA_Update(unsigned int* digest, unsigned int* buffer,
                           unsigned int* buffLen, unsigned int* loLen,
                           unsigned int* hiLen, int stateWords,
                           unsigned int blockSz, MXC_TPU_HASH_TYPE algo,
                           const unsigned char* data, unsigned int len)
{
    int status;
    unsigned int fill;

    if (len == 0) {
        return 0;
    }

