wolfSSL/wolfssl/wolfcrypt/src/port/maxim/max3266x.c
    /* Update total length */
    {
        unsigned int oldLo = *loLen;
        *loLen += len;
        if (*loLen < oldLo) {
            (*hiLen)++;
        }
    }

    /* If there's existing buffered data, try to complete a block */
    if (*buffLen > 0) {
        fill = blockSz - *buffLen;
        if (len < fill) {
            XMEMCPY((unsigned char*)buffer + *buffLen, data, len);
            *buffLen += len;
            return 0;
        }
        XMEMCPY((unsigned char*)buffer + *buffLen, data, fill);
        data += fill;
        len -= fill;

        /* Only process the completed buffer block if there's more data
         * coming. The TPU requires LAST to be set with real data (unless the
         * entire message is empty), so we always keep at least one block
         * buffered for Final. */
        if (len > 0) {
            *buffLen = 0;
            status = wolfSSL_HwHashMutexLock();
            if (status != 0) return status;
            wc_MXC_TPU_Hash_Setup(algo, digest, stateWords);
            wc_MXC_TPU_Hash_Feed_Block((const unsigned char*)buffer, blockSz);
            wc_MXC_TPU_Hash_Save_State(digest, stateWords);
            MAX3266X_MSG("SHA HW Acceleration Used");
            wolfSSL_HwHashMutexUnLock();
        }
        else {
            *buffLen = blockSz;
            return 0;
        }
    }

    /* Process full blocks directly from input, always leaving the last
     * complete block buffered so Final has data to feed with LAST. */
    if (len > blockSz) {
        status = wolfSSL_HwHashMutexLock();
        if (status != 0) return status;
        wc_MXC_TPU_Hash_Setup(algo, digest, stateWords);

        while (len > blockSz) {
            wc_MXC_TPU_Hash_Feed_Block(data, blockSz);
            data += blockSz;
            len -= blockSz;
        }

        wc_MXC_TPU_Hash_Save_State(digest, stateWords);
        MAX3266X_MSG("SHA HW Acceleration Used");
        wolfSSL_HwHashMutexUnLock();
    }

    /* Buffer remaining data (1..blockSz bytes) */
    if (len > 0) {
        XMEMCPY((unsigned char*)buffer, data, len);
        *buffLen = len;
    }

    return 0;
}

/* Generic Final */
int wc_MXC_TPU_SHA_Final(unsigned int* digest, unsigned int* buffer,
                           unsigned int* buffLen, unsigned int loLen,
                           unsigned int hiLen, int stateWords,
                           unsigned int digestSz, MXC_TPU_HASH_TYPE algo,
                           unsigned char* hash)
{
    int status;

    status = wolfSSL_HwHashMutexLock();
    if (status != 0) return status;

    wc_MXC_TPU_Hash_Setup(algo, digest, stateWords);
    wc_MXC_TPU_Hash_Feed_Last((const unsigned char*)buffer, *buffLen,
                               loLen, hiLen);
    wc_MXC_TPU_Hash_Read_Digest(hash, digestSz);
    MAX3266X_MSG("SHA HW Acceleration Used");

    wolfSSL_HwHashMutexUnLock();
    return 0;
}

/* Generic GetHash */
int wc_MXC_TPU_SHA_GetHash(unsigned int* digest, unsigned int* buffer,
                             unsigned int buffLen, unsigned int loLen,
                             unsigned int hiLen, int stateWords,
                             unsigned int digestSz, MXC_TPU_HASH_TYPE algo,
                             unsigned char* hash)
{
    int status;
    /* Use copies so we don't modify the real context */
    unsigned int tmpDigest[MXC_SHA512_STATE_WORDS];
    unsigned int tmpBuf[128 / sizeof(unsigned int)]; /* max block: 1024 bits */

    XMEMCPY(tmpDigest, digest, stateWords * sizeof(unsigned int));
    if (buffLen > 0) {
        XMEMCPY(tmpBuf, buffer, buffLen);
    }

    status = wolfSSL_HwHashMutexLock();
    if (status != 0) return status;

    wc_MXC_TPU_Hash_Setup(algo, tmpDigest, stateWords);
    wc_MXC_TPU_Hash_Feed_Last((const unsigned char*)tmpBuf, buffLen,
                               loLen, hiLen);
    wc_MXC_TPU_Hash_Read_Digest(hash, digestSz);
    MAX3266X_MSG("SHA HW Acceleration Used");

    wolfSSL_HwHashMutexUnLock();
    return 0;
}

/* Init helper: use TPU INIT to get the standard IV for any algorithm */
static int wc_MXC_TPU_SHA_Init(unsigned int* digest, int stateWords,
                                MXC_TPU_HASH_TYPE algo)
{
    int status = wolfSSL_HwHashMutexLock();
    if (status != 0) return status;

    MXC_TPU_Init(MXC_SYS_PERIPH_CLOCK_TPU);
    MXC_TPU->ctrl = MXC_F_TPU_CTRL_RST;
    while (!(MXC_TPU->ctrl & MXC_F_TPU_CTRL_RDY)) {}
    MXC_TPU->ctrl |= MXC_F_TPU_CTRL_FLAG_MODE;

    /* Select hash function and trigger INIT to load standard IV */
    MXC_TPU->hash_ctrl = (unsigned int)algo << MXC_F_TPU_HASH_CTRL_HASH_POS;
    MXC_TPU->hash_ctrl |= MXC_F_TPU_HASH_CTRL_INIT;
    while (MXC_TPU->hash_ctrl & MXC_F_TPU_HASH_CTRL_INIT) {}

    /* Save the standard IV into the context */
    wc_MXC_TPU_Hash_Save_State(digest, stateWords);

    wolfSSL_HwHashMutexUnLock();
    return 0;
}

#endif /* WOLFSSL_MAX3266X_SHA_ONESHOT */

/* Per-algorithm Init / Update / Final / GetHash / Copy / Free */

#ifndef MAX3266X_SHA_CB

#ifdef WOLFSSL_MAX3266X_SHA_ONESHOT

#if !defined(NO_SHA)

WOLFSSL_API int wc_InitSha_ex(wc_Sha* sha, void* heap, int devId)
{
    if (sha == NULL) {
        return BAD_FUNC_ARG;
    }
    (void)devId;
    XMEMSET(sha, 0, sizeof(*sha));
    sha->heap = heap;
    return 0;
}

WOLFSSL_API int wc_ShaUpdate(wc_Sha* sha, const unsigned char* data,
                                        unsigned int len)
{
    if (sha == NULL || (data == NULL && len > 0)) {
        return BAD_FUNC_ARG;
    }
    return _wc_Hash_Grow(&sha->msg, &sha->used, &sha->len,
                                        data, (int)len, sha->heap);
}

WOLFSSL_API int wc_ShaFinal(wc_Sha* sha, unsigned char* hash)
{
    if (sha == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_Final(&sha->msg, &sha->used, &sha->len,
                                        sha->heap, hash, MXC_TPU_HASH_SHA1);
}

WOLFSSL_API int wc_ShaGetHash(wc_Sha* sha, unsigned char* hash)
{
    if (sha == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_GetHash((const unsigned char*)sha->msg,
                                        sha->used, hash, MXC_TPU_HASH_SHA1);
}

WOLFSSL_API int wc_ShaCopy(wc_Sha* src, wc_Sha* dst)
{
    if (src == NULL || dst == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_Copy(src, dst, sizeof(wc_Sha),
                                        &dst->msg, &dst->used, &dst->len,
                                        dst->heap, src->heap);
}

