wolfSSL/wolfssl/wolfcrypt/src/port/maxim/max3266x.c
WOLFSSL_API void wc_ShaFree(wc_Sha* sha)
{
    if (sha == NULL) {
        return;
    }
    wc_MXC_TPU_SHA_FreeCtx(sha, sizeof(wc_Sha), &sha->msg, &sha->used,
                                        &sha->len, sha->heap);
}

#endif /* NO_SHA */

#if defined(WOLFSSL_SHA224)

WOLFSSL_API int wc_InitSha224_ex(wc_Sha224* sha224, void* heap, int devId)
{
    if (sha224 == NULL) {
        return BAD_FUNC_ARG;
    }
    (void)devId;
    XMEMSET(sha224, 0, sizeof(*sha224));
    sha224->heap = heap;
    return 0;
}

WOLFSSL_API int wc_InitSha224(wc_Sha224* sha224)
{
    return wc_InitSha224_ex(sha224, NULL, INVALID_DEVID);
}

WOLFSSL_API int wc_Sha224Update(wc_Sha224* sha224, const unsigned char* data,
                                        unsigned int len)
{
    if (sha224 == NULL || (data == NULL && len > 0)) {
        return BAD_FUNC_ARG;
    }
    return _wc_Hash_Grow(&sha224->msg, &sha224->used, &sha224->len,
                                        data, (int)len, sha224->heap);
}

WOLFSSL_API int wc_Sha224Final(wc_Sha224* sha224, unsigned char* hash)
{
    if (sha224 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_Final(&sha224->msg, &sha224->used, &sha224->len,
                                        sha224->heap, hash,
                                        MXC_TPU_HASH_SHA224);
}

WOLFSSL_API int wc_Sha224GetHash(wc_Sha224* sha224, unsigned char* hash)
{
    if (sha224 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_GetHash((const unsigned char*)sha224->msg,
                                        sha224->used, hash,
                                        MXC_TPU_HASH_SHA224);
}

WOLFSSL_API int wc_Sha224Copy(wc_Sha224* src, wc_Sha224* dst)
{
    if (src == NULL || dst == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_Copy(src, dst, sizeof(wc_Sha224),
                                        &dst->msg, &dst->used, &dst->len,
                                        dst->heap, src->heap);
}

WOLFSSL_API void wc_Sha224Free(wc_Sha224* sha224)
{
    if (sha224 == NULL) {
        return;
    }
    wc_MXC_TPU_SHA_FreeCtx(sha224, sizeof(wc_Sha224), &sha224->msg,
                                        &sha224->used, &sha224->len,
                                        sha224->heap);
}

#endif /* WOLFSSL_SHA224 */

#if !defined(NO_SHA256)

WOLFSSL_API int wc_InitSha256_ex(wc_Sha256* sha256, void* heap, int devId)
{
    if (sha256 == NULL) {
        return BAD_FUNC_ARG;
    }
    (void)devId;
    XMEMSET(sha256, 0, sizeof(*sha256));
    sha256->heap = heap;
    return 0;
}

WOLFSSL_API int wc_InitSha256(wc_Sha256* sha256)
{
    return wc_InitSha256_ex(sha256, NULL, INVALID_DEVID);
}

WOLFSSL_API int wc_Sha256Update(wc_Sha256* sha256, const unsigned char* data,
                                        unsigned int len)
{
    if (sha256 == NULL || (data == NULL && len > 0)) {
        return BAD_FUNC_ARG;
    }
    return _wc_Hash_Grow(&sha256->msg, &sha256->used, &sha256->len,
                                        data, (int)len, sha256->heap);
}

WOLFSSL_API int wc_Sha256Final(wc_Sha256* sha256, unsigned char* hash)
{
    if (sha256 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_Final(&sha256->msg, &sha256->used, &sha256->len,
                                        sha256->heap, hash,
                                        MXC_TPU_HASH_SHA256);
}

WOLFSSL_API int wc_Sha256GetHash(wc_Sha256* sha256, unsigned char* hash)
{
    if (sha256 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_GetHash((const unsigned char*)sha256->msg,
                                        sha256->used, hash,
                                        MXC_TPU_HASH_SHA256);
}

WOLFSSL_API int wc_Sha256Copy(wc_Sha256* src, wc_Sha256* dst)
{
    if (src == NULL || dst == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_Copy(src, dst, sizeof(wc_Sha256),
                                        &dst->msg, &dst->used, &dst->len,
                                        dst->heap, src->heap);
}

WOLFSSL_API void wc_Sha256Free(wc_Sha256* sha256)
{
    if (sha256 == NULL) {
        return;
    }
    wc_MXC_TPU_SHA_FreeCtx(sha256, sizeof(wc_Sha256), &sha256->msg,
                                        &sha256->used, &sha256->len,
                                        sha256->heap);
}

#endif /* NO_SHA256 */

#if defined(WOLFSSL_SHA384)

WOLFSSL_API int wc_InitSha384_ex(wc_Sha384* sha384, void* heap, int devId)
{
    if (sha384 == NULL) {
        return BAD_FUNC_ARG;
    }
    (void)devId;
    XMEMSET(sha384, 0, sizeof(*sha384));
    sha384->heap = heap;
    return 0;
}

WOLFSSL_API int wc_InitSha384(wc_Sha384* sha384)
{
    return wc_InitSha384_ex(sha384, NULL, INVALID_DEVID);
}

WOLFSSL_API int wc_Sha384Update(wc_Sha384* sha384, const unsigned char* data,
                                        unsigned int len)
{
    if (sha384 == NULL || (data == NULL && len > 0)) {
        return BAD_FUNC_ARG;
    }
    return _wc_Hash_Grow(&sha384->msg, &sha384->used, &sha384->len,
                                        data, (int)len, sha384->heap);
}

WOLFSSL_API int wc_Sha384Final(wc_Sha384* sha384, unsigned char* hash)
{
    if (sha384 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_Final(&sha384->msg, &sha384->used, &sha384->len,
                                        sha384->heap, hash,
                                        MXC_TPU_HASH_SHA384);
}

WOLFSSL_API int wc_Sha384GetHash(wc_Sha384* sha384, unsigned char* hash)
{
    if (sha384 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_GetHash((const unsigned char*)sha384->msg,
                                        sha384->used, hash,
                                        MXC_TPU_HASH_SHA384);
}

WOLFSSL_API int wc_Sha384Copy(wc_Sha384* src, wc_Sha384* dst)
{
    if (src == NULL || dst == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_Copy(src, dst, sizeof(wc_Sha384),
                                        &dst->msg, &dst->used, &dst->len,
                                        dst->heap, src->heap);
}

WOLFSSL_API void wc_Sha384Free(wc_Sha384* sha384)
{
    if (sha384 == NULL) {
        return;
    }
    wc_MXC_TPU_SHA_FreeCtx(sha384, sizeof(wc_Sha384), &sha384->msg,
                                        &sha384->used, &sha384->len,
                                        sha384->heap);
}

#endif /* WOLFSSL_SHA384 */

#if defined(WOLFSSL_SHA512)

WOLFSSL_API int wc_InitSha512_ex(wc_Sha512* sha512, void* heap, int devId)
{
    if (sha512 == NULL) {
        return BAD_FUNC_ARG;
    }
    (void)devId;
    XMEMSET(sha512, 0, sizeof(*sha512));
    sha512->heap = heap;
#if defined(WOLFSSL_SHA512_HASHTYPE)
    sha512->hashType = WC_HASH_TYPE_SHA512;
#endif
    return 0;
}

