wolfSSL/wolfssl/wolfcrypt/src/port/maxim/max3266x.c
WOLFSSL_API int wc_InitSha512(wc_Sha512* sha512)
{
    return wc_InitSha512_ex(sha512, NULL, INVALID_DEVID);
}

WOLFSSL_API int wc_Sha512Update(wc_Sha512* sha512, const unsigned char* data,
                                        unsigned int len)
{
    if (sha512 == NULL || (data == NULL && len > 0)) {
        return BAD_FUNC_ARG;
    }
    return _wc_Hash_Grow(&sha512->msg, &sha512->used, &sha512->len,
                                        data, (int)len, sha512->heap);
}

WOLFSSL_API int wc_Sha512Final(wc_Sha512* sha512, unsigned char* hash)
{
    if (sha512 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_Final(&sha512->msg, &sha512->used, &sha512->len,
                                        sha512->heap, hash,
                                        MXC_TPU_HASH_SHA512);
}

WOLFSSL_API int wc_Sha512GetHash(wc_Sha512* sha512, unsigned char* hash)
{
    if (sha512 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_GetHash((const unsigned char*)sha512->msg,
                                        sha512->used, hash,
                                        MXC_TPU_HASH_SHA512);
}

WOLFSSL_API int wc_Sha512Copy(wc_Sha512* src, wc_Sha512* dst)
{
    if (src == NULL || dst == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_Copy(src, dst, sizeof(wc_Sha512),
                                        &dst->msg, &dst->used, &dst->len,
                                        dst->heap, src->heap);
}

WOLFSSL_API void wc_Sha512Free(wc_Sha512* sha512)
{
    if (sha512 == NULL) {
        return;
    }
    wc_MXC_TPU_SHA_FreeCtx(sha512, sizeof(wc_Sha512), &sha512->msg,
                                        &sha512->used, &sha512->len,
                                        sha512->heap);
}

#endif /* WOLFSSL_SHA512 */

#else /* WOLFSSL_MAX3266X_SHA_ONESHOT */
/* Non-callback path: provide the wc_Sha* API functions directly */

#if !defined(NO_SHA)

WOLFSSL_API int wc_InitSha_ex(wc_Sha* sha, void* heap, int devId)
{
    if (sha == NULL) {
        return BAD_FUNC_ARG;
    }
    (void)devId;
    XMEMSET(sha, 0, sizeof(*sha));
    sha->heap = heap;
    return wc_MXC_TPU_SHA_Init(sha->digest, MXC_SHA1_STATE_WORDS,
                                MXC_TPU_HASH_SHA1);
}

WOLFSSL_API int wc_ShaUpdate(wc_Sha* sha, const unsigned char* data,
                              unsigned int len)
{
    if (sha == NULL || (data == NULL && len > 0)) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_Update(sha->digest,
                sha->buffer, &sha->buffLen, &sha->loLen, &sha->hiLen,
                MXC_SHA1_STATE_WORDS, WC_SHA_BLOCK_SIZE,
                MXC_TPU_HASH_SHA1, data, len);
}

WOLFSSL_API int wc_ShaFinal(wc_Sha* sha, unsigned char* hash)
{
    int ret;
    if (sha == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    ret = wc_MXC_TPU_SHA_Final(sha->digest,
                sha->buffer, &sha->buffLen, sha->loLen, sha->hiLen,
                MXC_SHA1_STATE_WORDS,
                WC_SHA_DIGEST_SIZE, MXC_TPU_HASH_SHA1, hash);
    if (ret == 0) {
        return wc_InitSha_ex(sha, sha->heap, INVALID_DEVID);
    }
    return ret;
}

WOLFSSL_API int wc_ShaGetHash(wc_Sha* sha, unsigned char* hash)
{
    if (sha == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_GetHash(sha->digest,
                sha->buffer, sha->buffLen, sha->loLen, sha->hiLen,
                MXC_SHA1_STATE_WORDS,
                WC_SHA_DIGEST_SIZE, MXC_TPU_HASH_SHA1, hash);
}

WOLFSSL_API int wc_ShaCopy(wc_Sha* src, wc_Sha* dst)
{
    if (src == NULL || dst == NULL) {
        return BAD_FUNC_ARG;
    }
    XMEMCPY(dst, src, sizeof(wc_Sha));
    return 0;
}

WOLFSSL_API void wc_ShaFree(wc_Sha* sha)
{
    if (sha == NULL) {
        return;
    }
    ForceZero(sha, sizeof(wc_Sha));
}

#endif /* !NO_SHA */

#if defined(WOLFSSL_SHA224)

WOLFSSL_API int wc_InitSha224_ex(wc_Sha224* sha224, void* heap, int devId)
{
    if (sha224 == NULL) {
        return BAD_FUNC_ARG;
    }
    (void)devId;
    XMEMSET(sha224, 0, sizeof(*sha224));
    sha224->heap = heap;
    return wc_MXC_TPU_SHA_Init(sha224->digest, MXC_SHA224_STATE_WORDS,
                                MXC_TPU_HASH_SHA224);
}

WOLFSSL_API int wc_InitSha224(wc_Sha224* sha224)
{
    return wc_InitSha224_ex(sha224, NULL, INVALID_DEVID);
}

WOLFSSL_API int wc_Sha224Update(wc_Sha224* sha224, const unsigned char* data,
                                 unsigned int len)
{
    if (sha224 == NULL || (data == NULL && len > 0)) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_Update(sha224->digest,
                sha224->buffer, &sha224->buffLen,
                &sha224->loLen, &sha224->hiLen,
                MXC_SHA224_STATE_WORDS, WC_SHA224_BLOCK_SIZE,
                MXC_TPU_HASH_SHA224, data, len);
}

WOLFSSL_API int wc_Sha224Final(wc_Sha224* sha224, unsigned char* hash)
{
    int ret;
    if (sha224 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    ret = wc_MXC_TPU_SHA_Final(sha224->digest,
                sha224->buffer, &sha224->buffLen,
                sha224->loLen, sha224->hiLen,
                MXC_SHA224_STATE_WORDS,
                WC_SHA224_DIGEST_SIZE, MXC_TPU_HASH_SHA224, hash);
    if (ret == 0) {
        return wc_InitSha224_ex(sha224, sha224->heap, INVALID_DEVID);
    }
    return ret;
}

WOLFSSL_API int wc_Sha224GetHash(wc_Sha224* sha224, unsigned char* hash)
{
    if (sha224 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_GetHash(sha224->digest,
                sha224->buffer, sha224->buffLen,
                sha224->loLen, sha224->hiLen,
                MXC_SHA224_STATE_WORDS,
                WC_SHA224_DIGEST_SIZE, MXC_TPU_HASH_SHA224, hash);
}

WOLFSSL_API int wc_Sha224Copy(wc_Sha224* src, wc_Sha224* dst)
{
    if (src == NULL || dst == NULL) {
        return BAD_FUNC_ARG;
    }
    XMEMCPY(dst, src, sizeof(wc_Sha224));
    return 0;
}

WOLFSSL_API void wc_Sha224Free(wc_Sha224* sha224)
{
    if (sha224 == NULL) {
        return;
    }
    ForceZero(sha224, sizeof(wc_Sha224));
}

#endif /* WOLFSSL_SHA224 */

#if !defined(NO_SHA256)

WOLFSSL_API int wc_InitSha256_ex(wc_Sha256* sha256, void* heap, int devId)
{
    if (sha256 == NULL) {
        return BAD_FUNC_ARG;
    }
    (void)devId;
    XMEMSET(sha256, 0, sizeof(*sha256));
    sha256->heap = heap;
    return wc_MXC_TPU_SHA_Init(sha256->digest, MXC_SHA256_STATE_WORDS,
                                MXC_TPU_HASH_SHA256);
}

