wolfSSL/wolfssl/wolfcrypt/src/port/maxim/max3266x.c
WOLFSSL_API int wc_InitSha256(wc_Sha256* sha256)
{
    return wc_InitSha256_ex(sha256, NULL, INVALID_DEVID);
}

WOLFSSL_API int wc_Sha256Update(wc_Sha256* sha256, const unsigned char* data,
                                 unsigned int len)
{
    if (sha256 == NULL || (data == NULL && len > 0)) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_Update(sha256->digest,
                sha256->buffer, &sha256->buffLen,
                &sha256->loLen, &sha256->hiLen,
                MXC_SHA256_STATE_WORDS, WC_SHA256_BLOCK_SIZE,
                MXC_TPU_HASH_SHA256, data, len);
}

WOLFSSL_API int wc_Sha256Final(wc_Sha256* sha256, unsigned char* hash)
{
    int ret;
    if (sha256 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    ret = wc_MXC_TPU_SHA_Final(sha256->digest,
                sha256->buffer, &sha256->buffLen,
                sha256->loLen, sha256->hiLen,
                MXC_SHA256_STATE_WORDS,
                WC_SHA256_DIGEST_SIZE, MXC_TPU_HASH_SHA256, hash);
    if (ret == 0) {
        return wc_InitSha256_ex(sha256, sha256->heap, INVALID_DEVID);
    }
    return ret;
}

WOLFSSL_API int wc_Sha256GetHash(wc_Sha256* sha256, unsigned char* hash)
{
    if (sha256 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_GetHash(sha256->digest,
                sha256->buffer, sha256->buffLen,
                sha256->loLen, sha256->hiLen,
                MXC_SHA256_STATE_WORDS,
                WC_SHA256_DIGEST_SIZE, MXC_TPU_HASH_SHA256, hash);
}

WOLFSSL_API int wc_Sha256Copy(wc_Sha256* src, wc_Sha256* dst)
{
    if (src == NULL || dst == NULL) {
        return BAD_FUNC_ARG;
    }
    XMEMCPY(dst, src, sizeof(wc_Sha256));
    return 0;
}

WOLFSSL_API void wc_Sha256Free(wc_Sha256* sha256)
{
    if (sha256 == NULL) {
        return;
    }
    ForceZero(sha256, sizeof(wc_Sha256));
}

#endif /* !NO_SHA256 */

#if defined(WOLFSSL_SHA384)

WOLFSSL_API int wc_InitSha384_ex(wc_Sha384* sha384, void* heap, int devId)
{
    if (sha384 == NULL) {
        return BAD_FUNC_ARG;
    }
    (void)devId;
    XMEMSET(sha384, 0, sizeof(*sha384));
    sha384->heap = heap;
    return wc_MXC_TPU_SHA_Init((word32*)sha384->digest,
                                MXC_SHA384_STATE_WORDS, MXC_TPU_HASH_SHA384);
}

WOLFSSL_API int wc_InitSha384(wc_Sha384* sha384)
{
    return wc_InitSha384_ex(sha384, NULL, INVALID_DEVID);
}

WOLFSSL_API int wc_Sha384Update(wc_Sha384* sha384, const unsigned char* data,
                                 unsigned int len)
{
    word32 loLen, hiLen;
    int ret;
    if (sha384 == NULL || (data == NULL && len > 0)) {
        return BAD_FUNC_ARG;
    }

    /* SHA-384/512 context uses word64 loLen/hiLen; the generic Update helper
     * uses word32. We bridge by converting here. */
    loLen = (word32)sha384->loLen;
    hiLen = (word32)(sha384->loLen >> 32);

    ret = wc_MXC_TPU_SHA_Update((word32*)sha384->digest,
                (word32*)sha384->buffer, &sha384->buffLen,
                &loLen, &hiLen,
                MXC_SHA384_STATE_WORDS, WC_SHA384_BLOCK_SIZE,
                MXC_TPU_HASH_SHA384, data, len);

    /* Write back the updated length */
    sha384->loLen = (word64)loLen | ((word64)hiLen << 32);
    return ret;
}

WOLFSSL_API int wc_Sha384Final(wc_Sha384* sha384, unsigned char* hash)
{
    int ret;
    if (sha384 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    ret = wc_MXC_TPU_SHA_Final((word32*)sha384->digest,
                (word32*)sha384->buffer, &sha384->buffLen,
                (word32)sha384->loLen, (word32)(sha384->loLen >> 32),
                MXC_SHA384_STATE_WORDS,
                WC_SHA384_DIGEST_SIZE, MXC_TPU_HASH_SHA384, hash);
    if (ret == 0) {
        return wc_InitSha384_ex(sha384, sha384->heap, INVALID_DEVID);
    }
    return ret;
}

WOLFSSL_API int wc_Sha384GetHash(wc_Sha384* sha384, unsigned char* hash)
{
    if (sha384 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    return wc_MXC_TPU_SHA_GetHash((word32*)sha384->digest,
                (word32*)sha384->buffer, sha384->buffLen,
                (word32)sha384->loLen, (word32)(sha384->loLen >> 32),
                MXC_SHA384_STATE_WORDS,
                WC_SHA384_DIGEST_SIZE, MXC_TPU_HASH_SHA384, hash);
}

WOLFSSL_API int wc_Sha384Copy(wc_Sha384* src, wc_Sha384* dst)
{
    if (src == NULL || dst == NULL) {
        return BAD_FUNC_ARG;
    }
    XMEMCPY(dst, src, sizeof(wc_Sha384));
    return 0;
}

WOLFSSL_API void wc_Sha384Free(wc_Sha384* sha384)
{
    if (sha384 == NULL) {
        return;
    }
    ForceZero(sha384, sizeof(wc_Sha384));
}

#endif /* WOLFSSL_SHA384 */

#if defined(WOLFSSL_SHA512)

WOLFSSL_API int wc_InitSha512_ex(wc_Sha512* sha512, void* heap, int devId)
{
    if (sha512 == NULL) {
        return BAD_FUNC_ARG;
    }
    (void)devId;
    XMEMSET(sha512, 0, sizeof(*sha512));
    sha512->heap = heap;
#if defined(WOLFSSL_SHA512_HASHTYPE)
    sha512->hashType = WC_HASH_TYPE_SHA512;
#endif
    return wc_MXC_TPU_SHA_Init((word32*)sha512->digest,
                                MXC_SHA512_STATE_WORDS, MXC_TPU_HASH_SHA512);
}

WOLFSSL_API int wc_InitSha512(wc_Sha512* sha512)
{
    return wc_InitSha512_ex(sha512, NULL, INVALID_DEVID);
}

WOLFSSL_API int wc_Sha512Update(wc_Sha512* sha512, const unsigned char* data,
                                 unsigned int len)
{
    word32 loLen, hiLen;
    int ret;
    if (sha512 == NULL || (data == NULL && len > 0)) {
        return BAD_FUNC_ARG;
    }

    loLen = (word32)sha512->loLen;
    hiLen = (word32)(sha512->loLen >> 32);

    ret = wc_MXC_TPU_SHA_Update((word32*)sha512->digest,
                (word32*)sha512->buffer, &sha512->buffLen,
                &loLen, &hiLen,
                MXC_SHA512_STATE_WORDS, WC_SHA512_BLOCK_SIZE,
                MXC_TPU_HASH_SHA512, data, len);

    sha512->loLen = (word64)loLen | ((word64)hiLen << 32);
    return ret;
}

WOLFSSL_API int wc_Sha512Final(wc_Sha512* sha512, unsigned char* hash)
{
    int ret;
    if (sha512 == NULL || hash == NULL) {
        return BAD_FUNC_ARG;
    }
    ret = wc_MXC_TPU_SHA_Final((word32*)sha512->digest,
                (word32*)sha512->buffer, &sha512->buffLen,
                (word32)sha512->loLen, (word32)(sha512->loLen >> 32),
                MXC_SHA512_STATE_WORDS,
                WC_SHA512_DIGEST_SIZE, MXC_TPU_HASH_SHA512, hash);
    if (ret == 0) {
        return wc_InitSha512_ex(sha512, sha512->heap, INVALID_DEVID);
    }
    return ret;
}

